app/views/donors/show.html.erb


   <% @donor.donations.each do |order| %>
---
SELECT "donations".* FROM "donations" INNER JOIN "donations_donors" ON "donations"."id" = "donations_donors"."donation_id" WHERE "donations_donors"."donor_id" = ?  [["donor_id", 7]]