app/views/orders/_form.html.erb

SELECT "customers".* FROM "customers" ORDER BY "customers"."last_name" ASC
---
    <%= f.label :customer %>
    <%= f.collection_select :customer_id, Customer.order(:last_name),:id,:full_name, include_blank: false %>