app/views/donations/_form.html.erb

SELECT "donors".* FROM "donors" ORDER BY "donors"."last_name" ASC
---
    <%= label_tag :donor %>
    <%= select_tag :donor, options_from_collection_for_select(Donor.order(:last_name),:id,:full_name) %>