app/views/checkouts/checkout.html.erb

SELECT "donors".* FROM "donors" ORDER BY "donors"."last_name" ASC
---
    <h1><%= label_tag :donor %></h1>
    <p><%= select_tag :donor, options_from_collection_for_select(Donor.order(:last_name),:id,:full_name) %></p>