app/controllers/checkouts_controller.rb

    def purchase
        @donor=Donor.find(params["donor"])
        @donations_donors= @donor.donations_donors
        @donations=@donor.donations.where(donations_donors: {purchased: false})
---
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "donations".* FROM "donations" INNER JOIN "donations_donors" ON "donations"."id" = "donations_donors"."donation_id" WHERE "donations_donors"."donor_id" = ? AND "donations_donors"."purchased" = ? ORDER BY "donations"."id" ASC LIMIT ?  [["donor_id", 11], ["purchased", "f"], ["LIMIT", 1]]
SELECT "donations_donors".* FROM "donations_donors" WHERE "donations_donors"."donor_id" = ?  [["donor_id", 16]]

    def donated
        @donor=Donor.find(params["id"])
---
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]