app/controllers/customers_controller.rb

INSERT INTO "customers" ("first_name", "last_name", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save

UPDATE "customers" SET "first_name" = ?, "last_name" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["first_name", "Tony"], ["last_name", "Stark"], ["phone", "2342342345"], ["email", "tony.stark@gmail.com"], ["updated_at", "2020-10-11 02:35:21.074779"], ["id", 5]]
---
  def update
    if @customer.update(customer_params)