app/controllers/donations_controller.rb

    def index
        @donations = Donation.all
---
SELECT "donations".* FROM "donations"

    def show
        @donation = Donation.find(params["id"])
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @donation = Donation.find(params["id"])
        @donors = Donor.all
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "donors".* FROM "donors"

    def update
        # require "pry"
        # binding.pry
        @donation = Donation.find(params["id"])
        @donor = Donor.find(params["donor"])
        if @donation.update(product_count: @donation.product_count+params['quantity'].to_i)
        # require "pry"
        # binding.pry
        DonationsDonor.create(donor:@donor, donation:@donation, purchased: false)
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "donations" SET "product_count" = ?, "updated_at" = ? WHERE "donations"."id" = ?  [["product_count", 1], ["updated_at", "2020-11-06 02:29:30.625739"], ["id", 1]]
INSERT INTO "donations_donors" ("donation_id", "donor_id", "purchased", "count") VALUES (?, ?, ?, ?)  [["donation_id", 1], ["donor_id", 16], ["purchased", "f"], ["count", 1]]

    def destroy
        @donation = Donation.find(params["id"])
        @donation.destroy
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "donations" WHERE "donations"."id" = ?  [["id", 1]]