app/controllers/donors_controller.rb

  def index
    @donors = Donor.all
---
SELECT "donors".* FROM "donors"

  def create
    @donor = Donor.new(donor_params)
    if @donor.save
---
INSERT INTO "donors" ("first_name", "last_name", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @donor.destroy
---
DELETE FROM "donors" WHERE "donors"."id" = ?  [["id", 1]]

    def set_donor
      @donor = Donor.find(params[:id])
---
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]