app/controllers/orders_controller.rb

    def create
        # @customer = Customer.find(params["customer_id"])
        # require "pry"
        # binding.pry
        # @order = Order.create(params["order"])
        @order = Order.create(order_params)
---
INSERT INTO "orders" ("product_name", "product_count", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_name", "Wings"], ["product_count", 3], ["customer_id", 1], ["created_at", "2020-10-16 00:42:50.969664"], ["updated_at", "2020-10-16 00:42:50.969664"]]

    def show
        @order = Order.find(params["id"])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def edit
        @order = Order.find(params["id"])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @order = Order.find(params["id"])
        if @order.update(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "product_name" = ?, "product_count" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["product_name", ""], ["product_count", nil], ["updated_at", "2020-10-16 23:34:44.202669"], ["id", 2]]

    def destroy
        @order = Order.find(params["id"])
        @order.destroy
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 3]]